app/views/users/show.html.erb

SELECT "attachments".* FROM "attachments" WHERE "attachments"."user_id" = ?  [["user_id", 3]]
---

<% @user.attachments.each do |attachment| %>