app/controllers/users_controller.rb

INSERT INTO "users" ("name", "file_upload", "string_upload", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Joish"], ["file_upload", "beer.jpg"], ["string_upload", "garten.jpg"], ["created_at", "2015-08-21 12:14:58.282794"], ["updated_at", "2015-08-21 12:14:58.282794"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "file_upload" = ?, "string_upload" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["file_upload", "51w1E3sN9-L._SL1500_.jpg"], ["string_upload", "file.png"], ["updated_at", "2015-09-22 16:31:38.189237"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)